resolutions/app/controllers/users_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Mr.banana"], ["password_digest", "$2a$10$qXYAJDSmetyJkVBvR6ycU.y3BdEDp3DFAm8K7SK9yrnwekvFsNmd."], ["session_token", "skIj7c77Q49LJdYIeCtg3Q"]]

  def update
    if current_user
      current_user.update(user_params)
---
UPDATE "users" SET "username" = $1 WHERE "users"."id" = $2  [["username", "potato"], ["id", 219]]